src/app/Http/Controllers/FavController.php

insert into "fav" ("github_id", "favs") values ('tiefblau1111', '10')
---
       public function add(Request $request, $id) {
           $token = $request->session()->get('github_token', null);
           $user = Socialite::driver('github')->userFromToken($token);
           $github_id = $user->user['login'];
           DB::table('fav')->insert(["github_id" => $github_id, "favs" => $id]);

delete from "fav" where "favs" = '33'
---
       public function destroy(Request $request, $id) {
           $token = $request->session()->get('github_token', null);
           $user = Socialite::driver('github')->userFromToken($token);
           $github_id = $user->user['login'];
           DB::table('fav')->where('favs', $id)->where('github_id', $github_id)->delete();