src/app/Http/Controllers/FavlistController.php

       public function index(Request $request, $id) {
           $favlist = DB::table('fav')->where('favs', $id)->get();
---
select * from "fav" where "favs" = '39'