src/app/Http/Controllers/PostController.php

       public function destroy($id)
       {
          Post::destroy($id);
---
delete from "posts" where "id" = 4