src/app/Http/Controllers/ProfileController.php

select * from "posts" where "github_id" = 'tiefblau7' order by "id" desc
select "avatar" from "user" where "github_id" = 'tiefblau7' limit 1
select * from "posts" where "github_id" = 'tiefblau7'
---
       public function index(Request $request, $github_id) {
           $post = Post::where('github_id', $github_id) -> orderBy('id', 'desc') ->get();
           $token = $request->session()->get('github_token', null);
           $avatar = DB::table('user')->where('github_id', $github_id)->value('avatar');
           $gittable = Post::where('github_id', $github_id)->get();